oh-my-fish/theme-bobthefish
oh-my-fish/plugin-brew
oh-my-fish/plugin-extract
oh-my-fish/plugin-osx
oh-my-fish/plugin-grc
jorgebucaran/fish-bax
jorgebucaran/fish-nvm
sadanand-singh/fish-sodope
franciscolourenco/done
oh-my-fish/plugin-pj
rbenv/fish-rbenv
jethrokuan/z
budimanjojo/tmux.fish
vitallium/tokyonight-fish
